"""
Задание 1.

1.1. Написать фикстуру для запуска разных браузеров (firefox, chrome, opera).
1.2. Выбор браузера должен осуществляться путем передачи аргумента командной строки pytest.
1.3. По завершению работы тестов должно осуществляться закрытие браузера.
1.3. Написать тест, который открывает основную страницу opencart и проверяет что title соотсвествует ожидаемому.
XXX: 1.4. Добавить опцию командной строки, которая указывает базовый URL opencart.

Написать тесты проверяющие наличие элементов на разных страницах приложения opencart.
Реализовать минимум пять тестов (одни тест = одна страница приложения). Использовать методы явного ожидания элементов.
Какие элементы проверять определить самостоятельно, но не меньше 5 для каждой страницы.
Покрыть нужно:
    2.1 Главную
    2.2 Каталог /index.php?route=product/category&path=20
    2.3 Карточку товара /index.php?route=product/product&path=57&product_id=49
    2.4 Страницу логина /index.php?route=account/login
    2.5 Страницу логина в админку /admin/
"""



def test_opencart(browser):
    browser.get('https://www.opencart.ru/')
    assert browser.title == 'Opencart.ru: разработка сайтов и модулей на платформе опенкарт'
